backend/controllers/OrderController.php

SELECT * FROM `order` WHERE `id`='151'
---
    protected function findModel($id)
    {
        if (($model = Order::findOne($id)) !== null) {