frontend/controllers/ProductController.php

SELECT * FROM `product`
---
    public function actionIndex()
    {
    	$product = Product::find()->all();//取出数据库的所有数据

SELECT * FROM `product` WHERE `item_id`='2'
---
    public function actionCheck(){
    	$request = Yii::$app->request;
    	$id = $request->get('id'); // 等价于: $get = $_GET;
    	$product = Product::find()->where(['item_id' => $id])->one();