backend/views/cate/index.php

                },'filter' => Html::activeDropDownList(
                        $searchModel,
                        'id',
                        ArrayHelper::map(Cate::get(0, Cate::find()->asArray()->all()), 'id', 'label'),
---
SELECT * FROM `Cate`