backend/models/Cate.php

SELECT * FROM `Cate` WHERE `id`=8
---
    public function getParentName($id){
    	if($id == 0){
    		return "一级分类";
    	}
    	$model = $this->find()->where(['id'=>$id])->one();