backend/models/Order.php

    public static function getUsername($id)
    {
        $data = User::find()->where(['id' => $id])->one();
---
SELECT * FROM `user` WHERE `id`=6