frontend/models/Cate.php

    public static function getParentName($id){
    	if($id == 0){
    		return "一级分类";
    	}
    	$model = Cate::find()->where(['id'=>$id])->one();
---
SELECT * FROM `cate` WHERE `id`=8