frontend/views/cate/index.php

SELECT * FROM `Cate`
---
            	'label' => '名称',
	            'value'=>function ($model) {
	            	return $model->getParentName($model->id);
	            },'filter' => Html::activeDropDownList(
	                    $searchModel,
	                    'id',
	                    ArrayHelper::map(Cates::get(0, Cates::find()->asArray()->all()), 'id', 'label'),
	                    ['class' => 'form-control', 'prompt' => Yii::t('app', '')]
	                ),